Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
/* Copyright (c) 2008  ATMEL Corporation
All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

* Redistributions of source code must retain the above copyright
notice, this list of conditions and the following disclaimer.
* Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in
the documentation and/or other materials provided with the
distribution.
* Neither the name of the copyright holders nor the names of
contributors may be used to endorse or promote products derived
from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
*/

/*
$Id: application.c,v 1.113.2.1 2009/02/06 21:27:26 bleverett Exp $
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "radio.h"
#include "timer.h"
#include "mac.h"
#include "mac_event.h"
#include "mac_start.h"
#include "mac_data.h"
#include "mac_scan.h"
#include "mac_associate.h"
#include "system.h"
#include "hal.h"
#include "sixlowpan.h"
#include "sleep.h"
#include "application.h"
#include "system.h"
#include <avr/boot.h>
#include <avr/wdt.h>

#include "machine.h"
#include "eeprom_map.h"

#include "reader.h"
#include "display.h"
#include "BowComm.h"


// mifare includes
#include "RegCtrl.h"
#include "reg52.h"
#include "Mifare.h"
#include "Rc522Reg.h"
#include "OpCtrl.h"
#include "ErrCode.h"
#include "spi.h"


u8 DataBuffer[128];
u8 swipe = 0;
u8 TOFlag =0;
u8 KPTOFlag = 0;
//u8 doItOnce = 1;			//PPOS
//u16 LOOP_IN  =0;			//PPOS
//u16 LOOP_OUT =0;			//PPOS
//bool ADMIN_INIT = false;	//PPOS
//bool ADMIN_CREDIT = false;	//PPOS
//bool SEND_BALANCE = false;	//PPOS
bool INSUFFCIENT_FUNDS;

//extern u8 OP;
extern u8 ucGetMachineStatusFlag;

//u8 ucReturnBillTimeout=0;
//
bool SETUP_TIMEOUT = true;

#if (DEBUG_BOW)
void DetermineState();
#endif // (DEBUG_BOW)


//Only the RUM stack uses these, otherwise undef them
#if !((IPV6_STACK == STACK_RUM) && IPV6LOWPAN)
#define sixlowpan_hc01_gen_rs(a)
#define sixlowpan_init()
#define sixlowpan_application_init()
#endif




extern bool Ping1Rx;
extern bool Ping2Rx;
extern bool Ping3Rx;
extern bool HaltValidation;
#if __AVR__
#include "serial.h"
#define euip_init_802154(a, b)


static u8 pingTimer;

#endif // __avr__


u16 uiFunctionEntered = 1;
u8 ucLed1State = 0;
bool VALIDATION_TIMEOUT = false;

/**
@addtogroup app
@{

This is a sample application, intended to show how the Route Under
MAC can be used to create a simple application.

@section app_network_start Joining the network

On startup, this application uses a number of callback functions to
bring up the network.  A coordinator node executes this process:

- Call macFindClearChannel(), which starts a channel scan to find a
free channel to use for the new PAN.

- When the scan is complete, the appClearChanFound() callback is
called. This then initializes the MAC/radio using the channel
found.

When a router or end node starts, it connects to the network using
these steps:

- appStartScan() is called, which scans all available channels,
issuing a beacon request frame on each channel.

- When the scan is complete, appScanConfirm() is called with an
argument that specifies whether the scan successfully found a
network to join.

- If the scan process found a network, then appAssociate() is
called, which causes the node to send an association request
packet to the node found in the channel scan.

- When an association response packet is received, the
appAssociateConfirm() function is called by the MAC.  At this
point, the node is part of the network and can send data packets
to other nodes.

@section app_data Sending and Receiving Data

To send data to another node, the application can call the
macDataRequest() function.  The application must know the address
of the destination node, unless the destination is the coordinator,
which always uses the short address 0x0000 (See @ref
DEFAULT_COORD_ADDR).

When a data packet is received, it is routed on to its
destination. If the final destination is this node's short
address, then the MAC will call the appDataIndication()
function, which can then process the incoming data.

Detect a card scenario
	1.case CARD_DETECTED
	2.case SHOW_BALANCE_REQUEST
	3.case SCARD_REMOVED
	4.case SCANNING
*/

// Set up function pointer to bootloader section.
void (*bootptr)( void ) = 0x1E000;

#define TRACKDEMO 0

// Application variables
static u8 failCount;  ///< Number of transmit-to-parent failures before re-scanning.
volatile u8 gotPanCoordPing;
// Function declarations
void appStartScan(void);
void ledcallback(void);
void sixlowpan_button(void);
void ValidationTimeout(void);
char * GetParam(char *ptrBuffer, char *tmpstr, char *EndChar);
char  ParamStr[100];

// These LED functions are used to provide address callbacks for macSetAlarm.
// Cannot use defines directly in callbacks.
void ledoff1(void)
{
	LED_OFF(1);
}

void ledoff2(void)
{
	LED_OFF(2);
}

void ledoff3(void)
{
	LED_OFF(3);
}

// This function can be used for diagnostic reasons. Not used in RUM application.
void blink1(void)
{
	LED_ON(1);
	macSetAlarm(25, ledoff1);
	
}

/**
Application callback function, called when the MAC receives a ping request
packet addressed to this node.

