Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
		debugMsgStrConst("\r\n\r\nREG DUMP\r\n");

		k = sizeof(rf2xx_reg_enum)/sizeof(rf2xx_reg_enum[0]);

		for(i=0;i<k;i++)
		{
			val =  hal_register_read(rf2xx_reg_enum[i]);
			sprintf((char*)str,"%-15s - %02X ", (char *)rf2xx_reg_names[i], (uint16_t)val);
			debugMsgStr((char *)str);
			for (j=7;j<8;j--)
			// Print a bit
			debugMsgChr(((val >> j)&1 ? '1' : '0' ));
			debugMsgCrLf();
		}

		debugMsgStrConst("\r\n");
	}
	#endif
}

/**
Application function, sends a data frame to the coordinator, and
schedules another call in two seconds, using the timer function.

This can be used for testing the network.  To send a real data
frame, use macDataRequest().
*/
void appSendDataFrame(void)
{
	// send data frames once per second
	if (NODETYPE != COORD)
	macDataRequest(0x00, 4, (u8*) ((NODETYPE == ENDDEVICE) ? "endd" : "rout"));

	// Send another data frame later
	macSetAlarm(1000, appSendDataFrame);
}

/**
Callback function, called when the MAC receives a data packet for
this node.
*/
void appDataIndication(void)
{
	// Write app code here -- This node has received a data frame.

	// Example code:
	/* typedef struct { */
		/*     char buf[SAMPLE_COUNT/2];  // two samples/byte */
		/*     short step_index; */
		/*     short predicted_value; */
		/* } tEncodedBuf; */
		// Find out the type of packet.


		u8 i;
		static u8 ucDataLength;

		// Find out the type of packet
		ftData *frame = (ftData *)(mac_buffer_rx+1);
		u8 size = *mac_buffer_rx;

		ucSendDataSize = 0;

		// End_Device Radio ENTRY POINT
		// if (!size)
		if(size ==0)
		return;
		
		if ((frame->type & 0x7f) == DATA_FRAME)
		{

			// Get the length first.
			ucDataLength = frame->payload[0];
			memset(DataBuffer,0,sizeof(DataBuffer));

			for (i = 0; i < ucDataLength; i++)
			{
				DataBuffer[i] = frame->payload[i+1];
			}
			#if (DEBUG)
			Led3_on();
			#endif

			OP = extractIncomingMessage((char*)DataBuffer);
			
			#if (DEBUG)
			Led3_off();
			#endif
			ucNumberOfRetry = 0;
		}

	}

	/**
	\brief Function to send result back to PC through serial.
	\param ucDataLength is the data size.
	\param pucDataBuffer is the pointer to the data to be sent.
	*/
	#if (NODETYPE == COORD)
	void Serial_send_data (u8 ucDataLength, u8* pucDataBuffer)
	{
		u16 i;
		serial_putchar(SOP);    // Send SOP
		serial_putchar(ucDataLength);   // Send Length
		for (i = 0; i < ucDataLength * 2; i++)
		{
			serial_putchar(pucDataBuffer[i]);
		}
		serial_putchar(EOP);    // Send EOP
	}


	/**
	\brief Convert data from Hexa to String.
	\param ucDataLength is the data size.
	\param pucDataBuffer is the pointer to the data to be converted.
	*/

	void Hexa_to_string_convert ( u8 ucDataLength, u8* pucDataBuffer )
	{
		u8 i, ucDataBuffer[ucDataLength];
		for (i = 0; i < ucDataLength; i++)
		{
			ucDataBuffer[i] = pucDataBuffer[i];
		}

		for (i = 0; i < ucDataLength; i++)
		{
			pucDataBuffer[2 * i] = Nible_to_ascii ( ucDataBuffer[i] >> 4 );
			pucDataBuffer[(2 * i) + 1] = Nible_to_ascii ( ucDataBuffer[i] );
		}
	}
	#endif // (NODETYPE == COORD)

	/**
	Example function, starts the network by scanning channels for a coordinator.

	This node will either scan all available channels, or just one
	channel if @ref macSetScanChannel() is called.  @see macScan().
	*/
	void appStartScan(void)
	{
		if(NODETYPE != COORD)
		{
			#ifdef DEBUG_RADIO
			debugMsgStrConst("\r\nStart scan ");
			#endif

			//macSetScanChannel(0x0f);//BOW is operating only on this channel
			macInit(0xff);
			
			macScan();
		}

		if (IPV6LOWPAN)
		sixlowpan_application_init();
	}

	/**
	Callback function, called when the MAC has associated a child of
	this node to the network.

	@param shortAddress The short address of the new child node that
	has been associated.  The MAC stores this address, so the
	application should not have to.
	*/
	void appChildAssociated(u16 shortAddress)
	{
		// Blip the LED when we associate a child
		LED_ON(2);
		macSetAlarm(LED_DELAY,ledoff2);
	}

	/**
	Callback function, called when the MAC has associated a new node to
	a network. This is only called for the coordinator.

	@param shortAddress The short address assigned to the new node.  The
	MAC stores this address, so the application should not have to.
	*/
	void appNodeAssociated(u16 shortAddress)
	{
	}


	/**
	Callback function, called when the MAC receives an association
	confirm packet addressed to this node, or the process timed out.

	@param success True if an association packet was received, or false
	if the association process timed out.
	*/
	void appAssociateConfirm(u8 success)
	{
		if(NODETYPE != COORD)
		{
			if (success == SUCCESS)
			{
				// send data frame after a bit
				#ifdef DEBUG_RADIO
				debugMsgStrConst("\r\nAssociated to ");
				debugMsgHex(macConfig.parentShortAddress);
				debugMsgStrConst(" as ");
				debugMsgHex(macConfig.shortAddress);
				#endif


				LED_ON(2);
				macSetAlarm(LED_DELAY,ledoff2);

				// For raven, notify other processor
				#if ((PLATFORM == RAVEN) && SERIAL)
				serial_send_frame(REPORT_ASSOCIATED, 2, (u8*)&macConfig.shortAddress);
				#endif
				
				/* 6lowpan association */
				if (IPV6LOWPAN)
				sixlowpan_hc01_gen_rs();
				
				// If we are auto-sending data, start that process.
				#if ((APP == SENSOR) && (NODETYPE != COORD))
				{
					sensorInit();
					sensorAutoSendStart();
				}
				#endif
				
				#if TRACKDEMO
				// Track Demo Application
				if (NODETYPE == ENDDEVICE)
				{
					// Re-associate every second
					macSetAlarm(1000, appStartScan);
				}
				#endif
				#if ((APP == TRACKER)  && (PLATFORM == DSK001))
				{
					// Sleep for a while
					nodeSleep(30);
					// Do the scan over
					appStartScan();
				}
				#endif
			}
			else
			{
				debugMsgStrConst("\r\nFailed to associate");

				if (VLP)
				{
					// Sleep for 10 seconds, try again
					nodeSleep(100);
					appStartScan();
				}
				else
				// Try again in one second
				//macSetAlarm(1000, appStartScan);
				macSetAlarm(((radioRandom(8)+50) *30)+1000, appStartScan);
			}
		}
	}

	/**
	Sample application function, associates this node to a network.
	This function is called after a successful @ref macScan.
	*/
	void appAssociate(void)
	{
		#ifdef DEBUG_RADIO
		debugMsgStrConst("\r\nAssociating to ");
		debugMsgHex(panDescriptor.coordAddr);
		debugMsgStrConst(" on ch ");
		debugMsgInt(panDescriptor.logicalChannel);
		debugMsgStrConst(", hops = ");
		debugMsgInt(panDescriptor.hopsToCoord);
		#endif

		macAssociate(panDescriptor.coordAddr, panDescriptor.logicalChannel);
	}

	/**
	Callback function, called when the MAC has completed its channel scan.

	@param success True if @ref macScan found a network to connect to,
	or false if no networks were found.
	*/
	void appScanConfirm(u8 success)
	{
		// Write app code here -- This (end or router) node has finished its scan,
		// and has received some beacons from prospective parents.

		// Example code:
		if(NODETYPE != COORD)
		{
			if (success)
			{
				// associate with coordinator
				macSetAlarm(30,appAssociate);

				#ifdef DEBUG_RADIO
				debugMsgStrConst("\r\nScan good, select chan ");
				debugMsgInt(panDescriptor.logicalChannel);
				#endif
			}
			else
			{
				// failure to find a network
				if (VLP)
				{
					// Try again after sleeping for 10 seconds
					if (NODETYPE == ENDDEVICE)
					nodeSleep(100);
					else
					// Router node
					macSetAlarm(1000, appStartScan);
				}
				else
				//macSetLongAlarm(30,appStartScan);// time between scan attempts
				macSetAlarm((radioRandom(8)+5) *10, appStartScan);
				
				debugMsgStrConst("\r\nScan bad");
			}
		}
	}

	/**
	Callback function, called when @ref macFindClearChannel()
	completes.

