Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
	u8 channel The clear channel selected for use by this PAN.
	*/
	void appClearChanFound(u8 channel)
	{
		if (NODETYPE == COORD)
		{
			macInit(channel);
			macStartCoord();
			#if (__AVR__ || __AVR32__)
			debugMsgStrConst("\r\nStartup, I am coordinator on ch ");
			#else
			fnDebugMsg("\r\nStartup, I am coordinator on ch ");
			#endif // __AVR__
			debugMsgInt(channel);
			macConfig.associated = true;

			#if ((IPV6_STACK == STACK_UIP) && IPV6LOWPAN)
			//Start uIP stack with 802.15.4 interface
			huip_init_802154(macConfig.panId, macConfig.shortAddress);
			#endif // IPV6LOWPAN
		}
	}

	#if __AVR__
	/**
	Verifies that the EEPROM contains valid data for the stored MAC
	address.  If the EEPROM is unprogrammed, then a random MAC address
	is written into EEPROM.

	Similarly, the sensor interval time is set to 2 seconds if the
	EEPROM is unprogrammed.
	*/
	void checkEeprom(void)
	{

		//check for First Run
		if(PLATFORM == RCBRFA1)
		{
			u64 NodeLongAddress;
			u32 low;
			u32 high;
			u8 regval;
			u8  i=0;
			
			u8 temp = READER_NEW;

			
			
			// Setup the address of this device by reading a stored address from eeprom.
			halGetMacAddr((u8*)&(NodeLongAddress));
			
			// Partition the long address
			low = NodeLongAddress & 0xffffffff;
			high = NodeLongAddress >> 32;
			
			// Vigin Board Configuration Found,
			// Request Setup Info from Reader

			if((low == 0xFFFFFFFF) && (high == 0xFFFFFFFF)){
				// Produce Random Number
				
				u8 buf[8];
				u8 bits =8;

				memset(&buf,0,sizeof(buf));
				// create random MAC address and store it
				radioInit(0); // Needed for random to work.
				radioSetTrxState(RX_ON);

				
				for (u8 x = 0;x < 8;x++){

					
					if(x < 4)
					buf[x] = 0xFF;			// Load lower 4-bytes w/ 0xFF

					else{
						
						i = radioGetTrxState();

						// Load upper 4-bytes w/ random number (4-bytes)
						if(i == RX_ON || i == RX_AACK_ON)
						// Must be in rx to get random numbers
						// Random number generator on-board
						// has two random bits each read
						for (i=0;i<bits/2;i++)
						{
							regval = hal_subregister_read(SR_RND_VALUE);
							buf[x]= (buf[x] << 2) | regval;
						}

					}
				}


				halPutMacAddr(buf);
				
				
				halPutEeprom(READER_STATE_ADDR,READER_STATE_FLAG_SIZE,&temp);
				eeprom_update_byte(MACHINE_LABEL_ADDR, 0); //make label empty string
				eeprom_update_byte(MACHINE_DESCRIPTION_ADDR, 0); //make description empty string
			}

			else if((low == 0xFFFFFFFF) && (high != 0x00000000)){
				
				halPutEeprom(READER_STATE_ADDR,READER_STATE_FLAG_SIZE,&temp);
				asm("nop");
			}
			
			
		}
	}
	#endif // __AVR__



	/**
	Sample application function, which initializes the application.
	This function is meant to be called on startup only.
	*/
	void appInit(void)
	{
		
		//#if (DEVICE_CONNECTED == ACA_MACHINE)
		u8 machineCode;
		u8 tmp=0;
		u8 machineTimerId;
		//#endif
		
		// Init the mac
		LED_INIT();
		Leds_on();
		Buzzer_init();
		Leds_off();

		// Blip the LED once on powerup
		Led1_on();

		OP = VALIDATE_READER;
		macSetAlarm(25, ledoff1);

		ucDeviceStateFlag = DEVICE_STATUS_NEEDED;
		

		#if (__AVR__)
		// If the EEPROM is cleared, init it to something useful
		checkEeprom();
		#endif // __AVR__
		
		initReader();

		
		#ifdef MACHINE_CONNECTED
		
		#if (DEVICE_CONNECTED == ACA_MACHINE)
		//wait up to 10 seconds for machine to become active
		machineTimerId = macSetAlarm(MACHINE_WAIT_TIMEOUT,WaitForMachine);
		
		while(ucMachineWait == MACHINE_WAIT)
		{
			if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)
			{
				SQACAInitializationSequence();
				
				tmp = macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
			}
			else if(ucDeviceStateFlag == MACHINE_STATUS_ON){
				macTimerEnd(machineTimerId);
				macTimerEnd(tmp);
				
				break;
			}
			else if( mac_event_pending() ){
				macTask();  //timer has timed out handle timer task.
			}
			
		}
		macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
		

		#endif // DEVICE_CONNECTED
		#else
		// FOR DEBUGGING USE ONLY
		//MdcStatus.MachineType[0] = 0x21;		//PPOS
		//MdcStatus.MachineType[1] = 1;			//PPOS
		
		#endif
		/*
		#if (DEBUG == 0)
		//start heartbeat
		HeartBeat();
		#endif
		*/
		#if (DEVICE_CONNECTED == ACA_MACHINE)
		// read machine code stored in EEPROM
		/********can check reader state flag here and update******/
		halGetEeprom(MACHINE_TYPE_ADDR, 1, &machineCode);
		
		//if a valid machine is connected, then store the machine type
		if((machineCode == 0xFF) && (SQACAMachineStatus.MachineType[0] != INVALID_MACHINE))
		{
			// save the actual machine code
			halPutEeprom(MACHINE_TYPE_ADDR, 1, &SQACAMachineStatus.MachineType[0]);
			halPutEeprom(MACHINE_TYPE_ADDR+1, 1, &SQACAMachineStatus.MachineType[1]);
		}
		else if(SQACAMachineStatus.MachineType[0] != machineCode)
		{
			// machine has been swapped - trigger setup request
			halPutEeprom(MACHINE_TYPE_ADDR, 1, &SQACAMachineStatus.MachineType[0]);
			halPutEeprom(MACHINE_TYPE_ADDR+1, 1, &SQACAMachineStatus.MachineType[1]);
			
			ReaderStateFlag.ReaderSetup = READER_SETUP_NEEDED;			//(ReaderStateFlag | READER_SETUP_NEEDED);
			halPutEeprom(READER_STATE_ADDR,1, (u8*)&ReaderStateFlag);
		}
		
		
		#endif //DEVICE_CONNECTED

		// Init the mac and stuff
		if (NODETYPE == COORD)
		{
			macFindClearChannel();
		}
		else
		{
			#ifdef DEBUG_RADIO
			debugMsgStrConst("\r\nStartup, I am router/end.");
			#endif

			// End node or router, start scanning for a coordinator
			appStartScan();
			// when scan is finished, appScanConfirm will be called.

			//Call RUM init
			sixlowpan_init();

			#ifndef COORDNODE

			#if (DEVICE_CONNECTED == ACA_MACHINE)
			if (ucDeviceStateFlag == MACHINE_STATUS_ON)
			{
				displayVersion();
				
				//Send machine setup at every power up if reader has setup and machine is connected
				if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE )
				{
					getSQReaderMachineSetup();			// get PROGRAMMING_DATA_TOPLOAD, _DRYER, _FRONTLOADER
					ucCardStatus = CARD_OUT;
					cardRemoved(REMOVE_CARD);
					
