Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
				}
			}
			#endif //ACA_MACHINE

			#endif

		}
		//ping coord every few seconds
		//pingTimer = 0;
		//doPing();
		

		asm("nop");
	}

	/**
	Sample application function. Sends a ping packet to the network
	coordinator.
	*/
	void doPing(void)
	{
		hal_register_write(RG_CSMA_BE,0);
		//macDataRequest(DEFAULT_COORD_ADDR, 110, dataString);
		macPing(PING_REQ_FRAME, DEFAULT_COORD_ADDR);

		// Uncomment the next line to make the button unleash a torrent of pings
		#if __AVR__ || __AVR32__
		//    pingTimer = macSetAlarmMs(5+(23*(BAND == BAND900)), doPing);
		if (pingTimer)
		{
			macTimerEnd(pingTimer);
		}
		pingTimer = macSetAlarm(10000, doPing);
		#endif
	}


	/**
	\brief Convert data from String to Hexa.
	\param ucDataLength is the data size.
	\param pucDataBuffer is pointer to data to be converted.
	*/

	void String_to_hexa_convert ( u8 ucDataLength, u8 * pucDataBuffer )
	{
		u8 i, ucDataBuffer[ucDataLength * 2];

		for (i = 0; i < ucDataLength * 2; i++)
		{
			ucDataBuffer[i] = pucDataBuffer[i];
		}
		for (i = 0; i < ucDataLength; i++)
		{
			ucDataBuffer[2 * i] = Ascii_to_nible ( ucDataBuffer[2 * i] );
			ucDataBuffer[(2 * i) + 1] = Ascii_to_nible ( ucDataBuffer[(2 * i) + 1] );
			pucDataBuffer[i] = ((ucDataBuffer[2 * i]) << 4) + ucDataBuffer[(2 * i) + 1];
		}
	}


	/**
	Sample application task loop function.  This function is meant to
	be called periodically.  It receives data from serial and sends it
	to end device. Machine status communication occur every 1/2 second.
	appTask calls function:
	DevicePoll
	if associated true
	switch OP
	appInit
	sendBOWSetupRequest
	sendBOWValidationRequest
	sendBOWCCTransaction
	macSetLongAlarm
	ValidationTimeout
	isMachineCycleRunning
	AnticollSelect
	readCardID
	SQACAMimicQuantumSequence
	waitForMachineStartKey
	KeypressTimeOut
	Beeps
	CommTimeOut
	sendSQACAVendingTransaction
	SetupTimeout
	GetParam
	Ascii_to_nible
	*/
	void appTask(void)				//after appInit()
	{
		//vars declaration
		ucSendDataSize = 0;
		unsigned char tmp[16];

		u8 ucTimerID=0xff;
		char *uctempBuf;
		char *ptr;

		// loop to convert
		// decimal to hexadecimal
		///u8 i =0;
		///u8 Nibble =0;
		u8 k, l;
		u8  Setup[30];
		u8 n = 0;

		

		
		#ifdef MACHINE_CONNECTED
		#if (DEVICE_CONNECTED == ACA_MACHINE)
		if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)	//do machine status communication every 1/2 second
		{
			DevicePoll();
			
			
			
			if (ucDeviceStateFlag == MACHINE_STATUS_ON)			//machine status 33, 41 and online
			{
				_delay_ms(5);
				
				if (ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED)
				{
					//Display "No Setup" message on machine
					displayMsg(SETUP_MSG);
				}
				else if (((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == false)) || (ReaderStateFlag.MaxNumTransReached == true))
				{
					//Display "Service message" message on machine
					displayMsg(SERVICE_MSG);
				}
				else if (ReaderStateFlag.Busy == true)
				{
					#if (DEVICE_CONNECTED == ACA_MACHINE)
					//Display busy message
					if( OP != WAIT_FOR_SERVER ) // ****need to put op code in a queue****
					{
						OP = WAIT_FOR_SERVER;
					}
					displayMsg(BUSY_MSG);
					#endif
				}
			}
			//PPOS ToDo: machine is not online, print error message
			
		}
		#endif // ACA_MACHINE
		
		#endif

		if(macConfig.associated == true/*/false*/ || ReaderStateFlag.EnableOfflineTransaction == true) //  Don't bother running the app until the reader has associated
		{
			
			switch(OP){
				//case #1 called by appInit
				case VALIDATE_READER:
				//TODO: fix machine type switch
				//
				#if (DEVICE_CONNECTED == ACA_MACHINE)
				if((ReaderStateFlag.EnableOfflineTransaction == true) && (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE))
				{
					OP = INIT_READER;
				}
				else{
					#endif //ACA_MACHINE
					
					#if (DEVICE_CONNECTED == ACA_MACHINE)
					if( ((ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED) || ( ReaderStateFlag.FirstRun == VIRGIN_READER)) && (SQACAMachineStatus.MachineType[0] != INVALID_MACHINE) ){
						
						SETUP_TIMEOUT = true;
						OP = SETUP_REQUEST; //enable when setup supported by server
						
						
						#endif
						
					}
					else if( (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE) && (ReaderStateFlag.ValidateSetup == VALIDATE_READER_SETUP) ){
						
						VALIDATION_TIMEOUT = false;
						sendBOWValidationRequest();
						// Clear Rx Buffer
						memset(DataBuffer,0,sizeof(DataBuffer));
						
						macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 15s

						// Wait for validation package to arrive
						OP = VALIDATE_SETUP;
						
					}
					else if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE){
						OP = INIT_READER;
					}
					#if( DEVICE_CONNECTED == ACA_MACHINE)
				}
				#endif //ACA_MACHINE
				break;
				//case #2
				case INIT_READER:
				#if (DEVICE_CONNECTED == ACA_MACHINE)
				
				if( isMachineCycleRunning() )
				{
					OP = CYCLE_STARTED;
				}
				else
				{
					OP = SCANNING;
				}
				
				#endif
				
				
				break;
				//case #3
				case SCANNING: //scan for card swipe

				// Enable Heart beat routine
				if (uiFunctionEntered < (20 * (F_CPU/4000000)))
				{
					uiFunctionEntered++;
				}
				else
				{
					
					Led1_toggle();
					
					uiFunctionEntered = 0;
				}

				
				if(!Request(ISO14443_3_REQALL, tmp))
				{
					u8 cardType;
					u8 cardKey[6] = {0xff,0xff,0xff,0xff,0xff,0xff};
					
					/*anti-collision and select the card*/
					if(!AnticollSelect(0, tmp, &cardType))
					{
						if(cardType == MIFARE_1K)
						{
							CurrentAccount.Type = MIFARE_1K;
							
							Authentication(MIFARE_AUTHENT_A,cardKey,tmp,0);
						}
						else
						{
							CurrentAccount.Type = 0;
						}
						OP = CARD_DETECTED;
						ledoff1();
					}
					
					
				}
				break;

				
				//case #4
				case CARD_DETECTED:
				{
					u8 cardNum[10] = {0};
					//memset(DataBuffer,0,sizeof(DataBuffer));	// Clear Buffer
					
					//Read CardID from User Zone
					if(!readCardID(CurrentAccount.Type, &cardNum[0]))
					{
						padLeft((char*)&cardNum[0],9,"200");
						
