Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
						CurrentAccount.ID = strtoul((const char*)cardNum,NULL,10);	//save active card's id
						//associated?
						if(macConfig.associated == true)
						{
							// Send Data Package via Radio
							sprintf((char*)ucSendDataBuffer+1, "<sN>%s</sN>",cardNum);

							ucSendDataSize = strlen((char*)ucSendDataBuffer+1);
							ucSendDataBuffer[0] = ucSendDataSize;   // Length
							ucSendDataSize = ucSendDataSize + 1;    // data size = data byte + size byte
							macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
							
							// Clear Rx Buffer
							memset(DataBuffer,0,sizeof(DataBuffer));
							
							OP = WAIT_FOR_SERVER;
							ReaderStateFlag.Busy = true;
							
						}
						#if (DEVICE_CONNECTED == ACA_MACHINE)

						else if((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == true) && (ReaderStateFlag.MaxNumTransReached == false))
						{
							//allow cycle to start when BOW is down
							CurrentAccount.Value = vendPrice * 100;
							
							if( SQACAMimicQuantumSequence(REGULAR_VEND)  )
							{
								OP = WAIT_FOR_SELECTION;
								
								KPTOFlag = 0;
								
								if( waitForMachineStartKey() )
								{
									macSetLongAlarm(MACHINE_KEYPRESS_WAITTIME,KeypressTimeOut);		//KeyPressWaitTime
								}
								else
								macSetAlarm(500, KeypressTimeOut); // if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.
								
							}
						}
						else{
							OP = SCANNING;
						}
						#endif
						
						#if (DEBUG)
						Beeps(1);
						#endif

						//Set Timeout timer
						TOFlag = 0;
						ucTimerID = macSetLongAlarm(SERVER_RESPONSE_TIMEOUT,CommTimeOut);
					}
					else
					{
						#if (DEBUG)
						debugMsgStr("\r\nInvalid CardID\r\n");
						#endif
						OP = SCARD_REMOVED;						
					}
				}
				break;
				//case #5
				case SEND_OFFLINE_TRANSACTIONS:
				
				if (timeout.sendingOfflineTransactions)
				{
					timeout.sendingOfflineTransactions = false;
					OP = IDLE;
				}
				break;
				
				case SHOW_BALANCE_REQUEST:
				//case #6
				case WAIT_FOR_SERVER: //wait for response from server

				if(DataBuffer[0] != '\0')
				{
					// Print response
					ReaderStateFlag.Busy = false;
					#if (DEBUG_BOW)
					debugMsgStr("\r\n");
					debugMsgStr(DataBuffer);
					debugMsgStr("\r\n");
					#endif

					OP = SCARD_REMOVED;	

					#if (DEVICE_CONNECTED == ACA_MACHINE )
					
					
					//Extract the Card Id
					if( (uctempBuf = strstr((char *)DataBuffer,"sN: ")) )
					{
						CurrentAccount.ID = strtoul((const char*)(uctempBuf+4),NULL,10);	//save active card's id
						
						//Display card balance on machine
						double fBalance = 0.0;
						
						uctempBuf = strstr((char *)DataBuffer,"Balance: ");
												
						uctempBuf += 9;
						ptr = strchr(uctempBuf,'.');
						k = ptr - uctempBuf;
						fBalance = atof(uctempBuf);
						
						// Format the Balance to XX.XX
						//capture numeric into string 
						if (k <2)
						sprintf(uctempBuf,"0%.2f",fBalance);
						else if(k == 2)
						sprintf(uctempBuf,"%.2f",fBalance);
						else
						strcpy(uctempBuf,"99.99");
						
						/*Format the Display Balance
						"1" is just a character as far as the LCD is concerned. It's not a number. The LCD wants you to send the "code" for each character you want to display.
						The codes for characters "0" through "9" are 48 through 57. So just adding 48 to any single-digit number will give you the code for the character that 
						corresponds to that digit, f.e. uctempBuf[0]=49. digit 1=uctempBuf[0]-0x30 .
						*/
						//split string into individual values, skip decimal point
						CurrentAccount.Value = (uctempBuf[0]-0x30) * 1000 + (uctempBuf[1]-0x30) * 100 + (uctempBuf[3]-0x30) * 10 + uctempBuf[4]-0x30;
														
						#if(DEVICE_CONNECTED == ACA_MACHINE)
						
						// give display control back to front end controller. Important! Don't forget!!!!
						//displayMsg(BLANK_MSG);
						
						//sendSQDisplayCommand(0x06,0x5B,0x7D,msgNumber[uctempBuf[0]-0x30],msgNumber[uctempBuf[1]-0x30],msgNumber[uctempBuf[3]-0x30],10);
						
						sendSQDisplayCommand(msgNumber[uctempBuf[0]-0x30], msgNumber[uctempBuf[1]-0x30], msgNumber[uctempBuf[3]-0x30], msgNumber[uctempBuf[4]-0x30], LED_BLANK, LED_BLANK,10);
						_delay_ms(2000);

						//display vend price
						if( SQACAMimicQuantumSequence(REGULAR_VEND) )
						{
							#if(DEBUG_BOW)
							debugMsgStr("\r\nSQACAMimicQuantumSequence(REGULAR_VEND)\r\n");
							#endif
							
							OP = WAIT_FOR_SELECTION;
							
							//Sound Buzzer
							#if (DEBUG)
							Beeps(2);
							#endif

							KPTOFlag = 0;
							
							if( waitForMachineStartKey() )
							{
								macSetLongAlarm(MACHINE_KEYPRESS_WAITTIME,KeypressTimeOut);
							}
							else
							macSetAlarm(500, KeypressTimeOut); // if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.
						}
						#endif	//ACA_MACHINE
					}	//serial number found in server database
					else //serial number error from server database
					{
						CommTimeOut();//TOFlag = 1;	//force timeout condition
					}
					#endif//ACA_MACHINE

				}

				else if(TOFlag == 1 || macConfig.associated == false) // server fails to respond in time
				{
					#if(DEBUG_BOW)
					debugMsgStr("\r\nTOFlag == 1\r\n");
					#endif

					// Error Occured
					// Re-enter SCANNING mode

					#if(DEVICE_CONNECTED == ACA_MACHINE)
					if ( cardRemoved(REMOVE_CARD) )
					{
						//TOFlag = 1;
						ReaderStateFlag.Busy = false;
						//send error message to machine display
						displayMsg(CARD_ERR_MSG);
						OP = IDLE;
					}
					#endif
					#if (DEBUG_BOW)
					debugMsgStr("\r\nServer Communication Error\r\n");
					#endif
					
				}

				//asm("nop");
				break;
				//case #7
				case WAIT_FOR_SELECTION: //wait to see if cycle start has been requested by user

				#if(DEVICE_CONNECTED == ACA_MACHINE)
				if( (SQACAMachineStatus.CmdToReader == DEDUCT_VEND_COMMAND || SQACAMachineStatus.CmdToReader == DEDUCT_TOPOFF_COMMAND) )
				{
					OP = START_CYCLE; // set only if vend price deduction successful.

