Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
				}
				else if(KPTOFlag == 1)
				{
					if ( cardRemoved(CASH_CARD) )
					{						
						OP = SCANNING;
					}
				}
				#endif
				
				break;
				//case #8
				case START_CYCLE:	// send start cycle command to machine

				#if(DEVICE_CONNECTED == ACA_MACHINE)

				if( sendSQACAVendingTransactions()  )
				{
					structTransaction vend;					
					
					vend.CardId			= CurrentAccount.ID;
					vend.vendPrice		= vendPrice * 100;
					vend.LocationId		= ReaderSetup.locationId;
					vend.ManufactureId	= ReaderSetup.manufacturerId;
					vend.MachineId[0]	= deviceStatus.deviceType[0];
					vend.MachineId[1]	= deviceStatus.deviceType[1];
					
					
					
					if((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == true))
					{//must be offline transaction, store a record.
						vend.isOffline = true;
						storeOfflineTransaction(CurrentAccount.ID);
					}
					else{
						vend.isOffline = false;
						CurrentAccount.Value -= (vendPrice*100);
						sendBOWCCTransaction(&vend);
					}
					OP = CYCLE_STARTED;
					
					//let server know machine is in use.

				}
				
				cardRemoved(CASH_CARD);
				
				#endif
				break;

				case CYCLE_STARTED: // WASH COMPLETED
				
				#if(DEVICE_CONNECTED == ACA_MACHINE)
				
				OP = SCANNING;
				
				
				#endif
				break;

				//case #10
				case TIME_OUT: // Server Communication Error Occurred
				break;

				//case #11
				case SETUP_REQUEST:
				
				if( SETUP_TIMEOUT == true)
				{
					#if(DEVICE_CONNECTED == ACA_MACHINE)
					
					#ifdef MACHINE_CONNECTED
					DevicePoll();
					
					#else
					deviceStatus.deviceType[0] = 33;
					deviceStatus.deviceType[1] = 1;
					#endif
					#endif //DEVICE_CONNECTED
					sendBOWSetupRequest();
					
					SETUP_TIMEOUT = false;
					macSetLongAlarm(SETUP_REQUEST_TIMEOUT, SetupTimeout);
				}
				break;
				
				
				//case #12
				case VALIDATE_SETUP:

				if((ptr = GetParam((char *)DataBuffer,"<ValidationResponse>","<")) != NULL)
				{

					u8 addr[8];
					static u8 Len =0;
					n = strlen(ptr);
					k = 0;
					l = 0;
					
					// Get length of Validation code
					halGetEeprom(VALIDATION_CODE_ADDR,1,&Len);
					
					// 	Get Validation Code from EEPROM
					halGetEeprom(((u8*)VALIDATION_CODE_ADDR+1),Len,addr);
					
					while (k < n)
					{
						Setup[l] = (Ascii_to_nible ( *(ptr+k) ) * 16)
						+  Ascii_to_nible ( *(ptr+k+1));
						k += 2;
						l++;
					}

					if(memcmp(addr,Setup,Len) == 0)
					{
						ReaderStateFlag.ValidateSetup = VALID_READER_SETUP; //Don't store this bit in eeprom it allows for validation check on every power cycle.
						OP = VALIDATE_READER;
					}
					else
					{
					
						OP = SETUP_REQUEST; // validation failed, request new setup info
						SETUP_TIMEOUT = true;
						
					}
				}

				// Response TIMEOUT
				if(VALIDATION_TIMEOUT)
				{
					VALIDATION_TIMEOUT = false;
					sendBOWValidationRequest();// Re-send Validation Request
					
					macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 5s
				}

				
				
				break;
				//case #13
				case UPDATE_READER_FIRMWARE:
				//process firmware update request from BOW
				
				break;

				//case #14
				
				case IDLE:
				
				OP = SCANNING;
				
				
				break;
				//case #15
				case SCARD_REMOVED:

				//#if(DEVICE_CONNECTED == ACA_MACHINE)
				ucCardStatus = CARD_OUT;
				cardRemoved(REMOVE_CARD);
				
				//#endif
				
				OP = SCANNING;
				
				break;
				//case #16
				case BOW_ERROR:
				OP = IDLE;
				break;
				//case #17
				case APP_INIT:
				appInit();
				break;
				
				default:
				break;
			} //switch OP


		}// macConfig.associated

	}//appTask

	void ValidationTimeout()
	{ VALIDATION_TIMEOUT = true;}

	char * GetParam(char *ptrBuffer, char *tmpstr, char *EndChar)
	{

		char *pStr;
		char *pStr2;
		u8 tmpstrlen =0;


		tmpstrlen = strlen(tmpstr);

		if((pStr = strstr(ptrBuffer,tmpstr)) != NULL){ //1
			if((pStr2 = strstr(pStr + tmpstrlen,EndChar)) != NULL){ //2 "<"
				memcpy(ParamStr,pStr + tmpstrlen, pStr2-(pStr+tmpstrlen));
				ParamStr[pStr2-(pStr + tmpstrlen)]  ='\0';

				return (char *)ParamStr;
			}//1
		}//2
		
		return '\0';
	}

	/**
	Callback function, called when the MAC finds no clear channel.
	This function will send packet again until the maximum retry number is reached.
	*/
	void appResendPacket(void)
	{
		#if (NODETYPE == COORD)
		associatedNodes_t *node;
		u64 *ulLongAddress;
		u8 ucResult[2];

		// Command has not been sent because clear channel was not found, try to re-send.
		if (ucNumberOfRetry < MAX_RETRY_TO_SEND_DATA)
		{
			node = macGetNode(1);
			ulLongAddress = &(node->nodeLongAddress); // Get node 1 long address
			macDataRequest(macGetNodeAddr(ulLongAddress), ucSerialReceiveDataBuffer[0] + 1, (u8*) ucSerialReceiveDataBuffer);
			ucNumberOfRetry++;
			debugMsgStr("Send command again\n\r");
			// Re-start timer to wait for result.
			Timer2_set ( 0x00, 0x07 );
		}
		else
		{
			// Can not send command.
			Timer2_stop ();
			ucResult[0] = CAN_NOT_SEND_CMD;
			Hexa_to_string_convert(1, ucResult);
			// Send error code
			// When sending data to serial, the total of data must not be multiple
			// of 16 bytes otherwise the data will not directly displayed by serial
			// terminal.
			Serial_send_data (1, ucResult);
			ucSendCmdState = START;
		}

		#elif (NODETYPE == ENDDEVICE)
		// Command has not been sent because clear channel was not found, try to re-send.
		if (ucNumberOfRetry < MAX_RETRY_TO_SEND_DATA)
		{
			macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
			#if (DEBUG)
			debugMsgStr("Send result again\n\r");
			#endif
		}
		else
		{
			#if (DEBUG)
			// Can not send result.
			debugMsgStr("Can't send result\n\r");
			#endif
		}
		#endif
	}
	/** @} */

	#ifndef COORDNODE

	void Beeps(u8 nBeeps)
	{
		for(u8 i= 0; i < nBeeps;i++)
		{
			for(u16 i= 0; i < 100;i++)
			{
				Buzzer_on();
				_delay_us(200);
				Buzzer_off();
				_delay_us(200);
			}
			_delay_ms(25);
		}
	}


	void CommTimeOut()
	{
		TOFlag = true;
		ReaderStateFlag.Busy = false;
	}

