Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
	void KeypressTimeOut()
	{
		KPTOFlag = true;
	}

	void HeartBeat()
	{
		static u8 ucHeartBeatTimer = 0;
		if( ucHeartBeatTimer != 0 )
		macTimerEnd(ucHeartBeatTimer);
		Led2_toggle();
		ucHeartBeatTimer = macSetAlarm(HEARTBEAT, HeartBeat);
	}

	void SetupTimeout()
	{
		SETUP_TIMEOUT = true;
	}

	#if (DEBUG_BOW)

	void DetermineState()
	{

		switch (OP)
		{

			case SETUP_RESPONSE:
			debugMsgStr("\n\rSETUP_RESPONSE:\n\r");
			break;

			case SETUP_REQUEST:
			debugMsgStr("\n\rSETUP_REQUEST:\n\r");
			break;

			case SETUP_PACKAGE:
			debugMsgStr("\n\rUPDATE_READERID:\n\r");
			break;

			case INIT_READER:
			debugMsgStr("\n\rINIT_READER:\n\r");
			break;
			
			case SCANNING:
			debugMsgStr("\n\rSCANNING:\n\r");
			break;

			case CARD_DETECTED:
			debugMsgStr("\n\rCARD_DETECTED:\n\r");
			break;

			case CYCLE_STARTED:
			debugMsgStr("\n\rCYCLE_STARTED:\n\r");
			break;

			case SCAN_ENABLE:
			debugMsgStr("\n\rSCAN_ENABLE:\n\r");
			break;

			case DISABLE_SCAN:
			debugMsgStr("\n\rDISABLE_SCAN:\n\r");
			break;

			case WAIT_FOR_RESPONSE:
			debugMsgStr("\n\rWAIT_FOR_RESPONSE:\n\r");
			break;

			case TIME_OUT:
			debugMsgStr("\n\rTIME_OUT:\n\r");
			break;

			case WAIT_FOR_SELECTION:
			debugMsgStr("\n\rWAIT_FOR_SELECTION:\n\r");
			break;

			case ENABLE_SCAN:
			debugMsgStr("\n\rENABLE_SCAN:\n\r");
			break;

			case SCARD_REMOVED:
			debugMsgStr("\n\rSCARD_REMOVED:\n\r");
			break;

			case START_CYCLE:
			debugMsgStr("\n\rSTART_CYCLE:\n\r");
			break;

			default:
			break;
			
		}

	}
	#endif // (DEBUG_BOW)
		
	void SetDeviceState(void)
	{
		ucDeviceStateFlag = DEVICE_STATUS_NEEDED;
	}

	void DevicePoll(void)
	{
		#if (DEVICE_CONNECTED == ACA_MACHINE )

		SQACAMachineStatusCommSequence();					//SQ Payment System Driven Vending
		macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
		
		
		#endif

	}
	/**
	\brief The PadLeft method right-aligns and pads a string so that its rightmost character is the specified distance from the beginning of the string.
	PadLeft return newString objects that can either be padded with empty spaces or with custom characters.
	\param string is the string size.
	\param paddedLength is the data size.
	\param pad is pointer to data to be converted.
	*/
	
	char * padLeft(char * string, u8 paddedLength, const char * pad)
	{
		size_t stringLength = strlen(string);
		size_t lenpad = strlen(pad);
		u8 i = paddedLength;
		
		if (stringLength >= paddedLength)
		{
			return NULL;//'\0';
		}

		char * padded = (char*)malloc(paddedLength + 1); // allocate memory for new string
		
		for(; paddedLength > stringLength; paddedLength--, padded += lenpad)
		{
			strncpy(padded, pad, lenpad);
		}
		
		strncpy(padded, string, stringLength); /* copy without '\0' */
		padded += stringLength; /* prepare for first append of pad */
		*padded = '\0';

		padded = (padded - i);
		strncpy(string,padded,i);
		
		return padded;
	}
	#endif // ifndef COORDNODE


